IDEA Open Model
WeldParam Properties
Compatible with IDEA StatiCa v 10.1
The WeldParam type exposes the following members.
Properties
Name | Description
ItemId
 Mprl ItemId
 (Inherited from MprlRecord.)
Name
 Name of the item
 (Inherited from MprlRecord.)
Size
 Gets or sets the size of the weld
TableId
 Mprl TableId
 (Inherited from MprlRecord.)
WeldType
 Gets or sets the type of the weld
Top
See Also
Reference
WeldParam Class
IdeaRS.OpenModel.Parameters Namespace